
## Plan Result (shared)

[CI link](https://github.com/goda6565/portfolio/actions/runs/15202136638)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.artifact_registry.google_artifact_registry_repository.artifact_registry_repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry.google_artifact_registry_repository.artifact_registry_repository will be created
  + resource "google_artifact_registry_repository" "artifact_registry_repository" {
      + create_time      = (known after apply)
      + description      = "Docker Repository for My Portfolio"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "portfolio-460206"
      + repository_id    = "portfolio"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + vulnerability_scanning_config (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label shared/add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/32/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":32,"Program":"tfcmt","SHA1":"47d9115136ffb3646b52e258d0855ae4794d1a97","Target":"shared","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->